# 04 - Pandas - Processamento e Análise de Dados
## Aula 11 - 19 - Pandas - Classificação e Ordenação de Dataframes e Séries

## Professor: Orlando Oliveira dos Santos, MsC.
 - E-mail: professor.orlando.santos@gmail.com 
 - Youtube :https://www.youtube.com/channel/UCPWWbkPWFmOjXH50TQWNAYg
 - Linkedin: https://linkedin.com/in/orlandoosantos
 - Facebook: https://www.facebook.com/proforlandosantosmsc/
 - Twitter: https://twitter.com/ProfOrlandoMsC
 - Instagram: https://www.instagram.com/proforlandosantosmsc/

## Formação Acadêmica
- Mestrado em Computação Aplicada - UnB (2014 – 2016)	
- MBA, Administração Estratégica de Sistemas de Informação – FGV (2011 – 2013)
- Tecnólogo em Processamento de Dados, Análise e Desenvolvimento de Sistemas – FAETEC/SP (2000-2002)

# Pandas - Classificação e Ordenação de Dataframes e Séries

# Classificando - Ordenação de Dados
O Pandas suporta três tipos de classificação: classificação por rótulos de índice, classificação por valores de coluna e classificação por uma combinação de ambos.

## Ordenando DataFrame Por índice 
Os métodos Series.sort_index()e DataFrame.sort_index()são usados ​​para classificar um objeto pandas por seus níveis de índice.

In [1]:
import pandas as pd
df = pd.read_csv('./content/totaisestadoscomregiao_arr.csv', sep=';',names =['REGIAO', 'UF', 'CASOS','OBITOS'], index_col=False)
df.head()

         REGIAO  UF   CASOS  OBITOS
0  Centro-Oeste  DF  221526    3845
1  Centro-Oeste  GO  269857    6107
2  Centro-Oeste  MS   89654    1699
3  Centro-Oeste  MT  152968    4009
4      Nordeste  AL   92951    2304

In [2]:
import numpy as np
index = np.array(df.index)
print(index)
np.random.shuffle(index)
print(index)

[ 0  1  2  3  4  5  6  7  8  9 10 11 12 13 14 15 16 17 18 19 20 21 22 23
 24 25 26]
[21 26 11  5  2 19  8 20 25 10  4  3  1  6 17 22 18 23 14 13 15 12  9 16
 24  0  7]

In [3]:
df = df.reindex(index)
df.head()

          REGIAO  UF   CASOS  OBITOS
21       Sudeste  MG  387751    9605
26           Sul  SC  306788    3384
11      Nordeste  RN   84381    2649
5       Nordeste  BA  377445    8013
2   Centro-Oeste  MS   89654    1699

In [4]:
df.sort_index().head()

         REGIAO  UF   CASOS  OBITOS
0  Centro-Oeste  DF  221526    3845
1  Centro-Oeste  GO  269857    6107
2  Centro-Oeste  MS   89654    1699
3  Centro-Oeste  MT  152968    4009
4      Nordeste  AL   92951    2304

In [5]:
df.sort_index(ascending=False).head()

     REGIAO  UF    CASOS  OBITOS
26      Sul  SC   306788    3384
25      Sul  RS   287204    6356
24      Sul  PR   246169    5793
23  Sudeste  SP  1184496   40927
22  Sudeste  RJ   332396   21698

In [6]:
df.sort_index(axis=1).head()

     CASOS  OBITOS        REGIAO  UF
21  387751    9605       Sudeste  MG
26  306788    3384           Sul  SC
11   84381    2649      Nordeste  RN
5   377445    8013      Nordeste  BA
2    89654    1699  Centro-Oeste  MS

## Ordenando Series Por índice

In [7]:
df['UF'].sort_index().head()

0    DF
1    GO
2    MS
3    MT
4    AL
Name: UF, dtype: object

A classificação por índice também oferece suporte a um parâmetro key  que usa uma função que pode ser chamada para ser aplicada ao índice que está sendo classificado.

In [8]:
df.head()

          REGIAO  UF   CASOS  OBITOS
21       Sudeste  MG  387751    9605
26           Sul  SC  306788    3384
11      Nordeste  RN   84381    2649
5       Nordeste  BA  377445    8013
2   Centro-Oeste  MS   89654    1699

In [9]:
df.set_index('UF')

          REGIAO    CASOS  OBITOS
UF
MG       Sudeste   387751    9605
SC           Sul   306788    3384
RN      Nordeste    84381    2649
BA      Nordeste   377445    8013
MS  Centro-Oeste    89654    1699
TO         Norte    78618    1144
PB      Nordeste   140355    3223
ES       Sudeste   174144    4058
RS           Sul   287204    6356
PI      Nordeste   120913    2554
AL      Nordeste    92951    2304
MT  Centro-Oeste   152968    4009
GO  Centro-Oeste   269857    6107
CE      Nordeste   288122    9461
RO         Norte    76019    1511
RJ       Sudeste   332396   21698
RR         Norte    61001     709
SP       Sudeste  1184496   40927
AM         Norte   171161    4728
AC         Norte    33725     709
AP         Norte    55652     783
SE      Nordeste    86361    2266
PE      Nordeste   172716    8873
PA         Norte   263155    6844
PR           Sul   246169    5793
DF  Centro-Oeste   221526    3845
MA      Nordeste   190321    4203

In [10]:
df.set_index('UF').sort_index(key=lambda idx: [x[1] for x in  idx]).head(10)

          REGIAO   CASOS  OBITOS
UF
MA      Nordeste  190321    4203
PA         Norte  263155    6844
BA      Nordeste  377445    8013
PB      Nordeste  140355    3223
SC           Sul  306788    3384
AC         Norte   33725     709
PE      Nordeste  172716    8873
SE      Nordeste   86361    2266
CE      Nordeste  288122    9461
DF  Centro-Oeste  221526    3845

### Ordenando DataFrames Por valores 

O método Series.sort_values() é usado para classificar uma série por seus valores. 

O método DataFrame.sort_values() é usado para classificar um DataFrame por seus valores de coluna ou linha. 


O parâmetro opcional by para DataFrame.sort_values()pode ser usado para especificar uma ou mais colunas a serem usadas para determinar a ordem de classificação.

In [11]:
df.sort_values(by='UF').head()

      REGIAO  UF   CASOS  OBITOS
13     Norte  AC   33725     709
4   Nordeste  AL   92951    2304
14     Norte  AM  171161    4728
15     Norte  AP   55652     783
5   Nordeste  BA  377445    8013

O byparâmetro pode levar uma lista de nomes de coluna, por exemplo:

In [12]:
df.sort_values(by=['REGIAO','UF']).head()

         REGIAO  UF   CASOS  OBITOS
0  Centro-Oeste  DF  221526    3845
1  Centro-Oeste  GO  269857    6107
2  Centro-Oeste  MS   89654    1699
3  Centro-Oeste  MT  152968    4009
4      Nordeste  AL   92951    2304

Esses métodos têm tratamento especial de valores NA por meio do na_position argumento:

In [13]:
import pandas as pd
df = pd.read_csv('./content/totaisestadoscomregiao_arr.csv', sep=';',names =['REGIAO', 'UF', 'CASOS','OBITOS'], index_col=False)
df.head()

         REGIAO  UF   CASOS  OBITOS
0  Centro-Oeste  DF  221526    3845
1  Centro-Oeste  GO  269857    6107
2  Centro-Oeste  MS   89654    1699
3  Centro-Oeste  MT  152968    4009
4      Nordeste  AL   92951    2304

In [14]:
df.loc[ 20 , ['OBITOS']] = np.nan
df.loc[ 26 , ['OBITOS']] = np.nan

In [15]:
df.sort_values(by='OBITOS', na_position='first').head()

     REGIAO  UF   CASOS  OBITOS
20  Sudeste  ES  174144     NaN
26      Sul  SC  306788     NaN
18    Norte  RR   61001   709.0
13    Norte  AC   33725   709.0
15    Norte  AP   55652   783.0

A classificação também oferece suporte a um parâmetro key   que usa uma função chamável para aplicar aos valores que estão sendo classificados.

In [16]:
df['CASOS'].sort_values(key=lambda x: x//100_000, ascending=False)

23    1184496
26     306788
5      377445
22     332396
21     387751
1      269857
25     287204
24     246169
16     263155
0      221526
6      288122
10     120913
20     174144
9      172716
14     171161
3      152968
8      140355
7      190321
2       89654
4       92951
18      61001
19      78618
11      84381
17      76019
15      55652
12      86361
13      33725
Name: CASOS, dtype: int64

A chave receberá os Series valores de e deve retornar um Series ou array da mesma forma com os valores transformados. Para objetos DataFrame , a chave é aplicada por coluna, então a chave ainda deve esperar uma série e retornar uma série, por exemplo

In [17]:
df.sort_values(by='CASOS',  key=lambda x: x//100_000, ascending=False)

          REGIAO  UF    CASOS   OBITOS
23       Sudeste  SP  1184496  40927.0
26           Sul  SC   306788      NaN
5       Nordeste  BA   377445   8013.0
22       Sudeste  RJ   332396  21698.0
21       Sudeste  MG   387751   9605.0
1   Centro-Oeste  GO   269857   6107.0
25           Sul  RS   287204   6356.0
24           Sul  PR   246169   5793.0
16         Norte  PA   263155   6844.0
0   Centro-Oeste  DF   221526   3845.0
6       Nordeste  CE   288122   9461.0
10      Nordeste  PI   120913   2554.0
20       Sudeste  ES   174144      NaN
9       Nordeste  PE   172716   8873.0
14         Norte  AM   171161   4728.0
3   Centro-Oeste  MT   152968   4009.0
8       Nordeste  PB   140355   3223.0
7       Nordeste  MA   190321   4203.0
2   Centro-Oeste  MS    89654   1699.0
4       Nordeste  AL    92951   2304.0
18         Norte  RR    61001    709.0
19         Norte  TO    78618   1144.0
11      Nordeste  RN    84381   2649.0
17         Norte  RO    76019   1511.0
15         Norte  AP    55652    783.0
12      Nordeste  SE    86361   2266.0
13         Norte  AC    33725    709.0

## menor / maior valor 
Series tem os métodos nsmallest() e nlargest() que retornam o menor ou o maior nvalores.

In [18]:
df['CASOS'].nsmallest(5)

13    33725
15    55652
18    61001
17    76019
19    78618
Name: CASOS, dtype: int64

In [19]:
df['CASOS'].nlargest(5)

23    1184496
21     387751
5      377445
22     332396
26     306788
Name: CASOS, dtype: int64

Data Frametambém tem os métodos nlargeste nsmallest.

In [20]:
df.nlargest(3, 'CASOS')

      REGIAO  UF    CASOS   OBITOS
23   Sudeste  SP  1184496  40927.0
21   Sudeste  MG   387751   9605.0
5   Nordeste  BA   377445   8013.0

In [21]:
df.nlargest(5, ['CASOS', 'OBITOS'])

      REGIAO  UF    CASOS   OBITOS
23   Sudeste  SP  1184496  40927.0
21   Sudeste  MG   387751   9605.0
5   Nordeste  BA   377445   8013.0
22   Sudeste  RJ   332396  21698.0
26       Sul  SC   306788      NaN

In [22]:
df.nsmallest(3, 'CASOS')

   REGIAO  UF  CASOS  OBITOS
13  Norte  AC  33725   709.0
15  Norte  AP  55652   783.0
18  Norte  RR  61001   709.0

In [23]:
df.nsmallest(5, ['CASOS', 'OBITOS'])

   REGIAO  UF  CASOS  OBITOS
13  Norte  AC  33725   709.0
15  Norte  AP  55652   783.0
18  Norte  RR  61001   709.0
17  Norte  RO  76019  1511.0
19  Norte  TO  78618  1144.0